##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [1]:
import numpy as np
import pandas as pd

In [6]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인

df = pd.read_csv('./data/titanic.csv')
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [7]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력

df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [9]:
# 2. 승객 나이의 평균 출력
print(df['Age'].mean())

29.69911764705882

In [16]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
df['Name'][(df['Pclass'] == 1) & (df['Fare'] == df["Fare"].max())]

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [26]:
# 4. 여성 승객의 수를 구하여 출력
print(len(df[df['Sex'] == 'female']))

314

In [27]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력

df[['Name', 'Fare']][df['Fare'] >= 50]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [28]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
total_eighteen = df[df['Age'] < 18]
survived_eighteen = total_eighteen[total_eighteen['Survived'] == 1]

print(len(survived_eighteen) / len(total_eighteen))

0.5398230088495575

In [29]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력

print(df['Fare'][df['Pclass'] == 2].mean())

20.662183152173913

In [31]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력

print(df[['Age', 'Name']][df['Age'] == df['Age'].max()])

      Age                                  Name
630  80.0  Barkworth, Mr. Algernon Henry Wilson

In [32]:
# 9. S 항구에서 탑승한 승객의 수를 출력

print(len(df[df['Embarked'] == 'S']))

644

In [33]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력

print(len(df[(df['Pclass'] == 3) & (df['Sex'] == 'male') & df['Survived'] == 1]))

47

- 고급문제

In [ ]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

# DataFrameGroupBy 객체는 boolean 마스크로 바로 슬라이싱할 수 없기 때문에 생기는 에러. 
# 그룹화한 뒤에 다시 [...]로 필터링을 시도하면, Pandas가 “키”로 해석해서 "False" 같은 문자열을 찾기 떄문 .
# 해결하려면 먼저 원본 df에서 Survived 조건으로 행을 걸러내고, 그 다음 Pclass로 그룹화:

groupby_Pclass_survived =  df[df['Survived'] == 1].groupby('Pclass')
groupby_Pclass_dead =  df[df['Survived'] == 0].groupby('Pclass')

print(groupby_Pclass_survived['Age'].mean())
print(groupby_Pclass_dead['Age'].mean())

Pclass
1    35.368197
2    25.901566
3    20.646118
Name: Age, dtype: float64
Pclass
1    43.695312
2    33.544444
3    26.555556
Name: Age, dtype: float64

In [46]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

sibsp_sorted = df[df['SibSp'] >=3].sort_values('Fare', ascending= False)
sibsp_sorted[['Name', 'Age']].head()

                               Name   Age
27   Fortune, Mr. Charles Alexander  19.0
88       Fortune, Miss. Mabel Helen  23.0
341  Fortune, Miss. Alice Elizabeth  24.0
159      Sage, Master. Thomas Henry   NaN
180    Sage, Miss. Constance Gladys   NaN

In [50]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

age_nan = df[df['Age'].isnull()].groupby('Embarked')
age_nan.describe()

         PassengerId                                                       \
               count        mean         std   min     25%    50%     75%
Embarked
C               38.0  418.105263  277.427350  20.0  151.25  458.5  583.50
Q               49.0  420.102041  244.559404   6.0  242.00  389.0  614.00
S               90.0  451.388889  243.667839  18.0  239.75  461.5  647.75

                Survived            ... Parch       Fare             \
            max    count      mean  ...   75%  max count       mean
Embarked                            ...
C         860.0     38.0  0.368421  ...   0.0  2.0  38.0  31.413592
Q         829.0     49.0  0.448980  ...   0.0  2.0  49.0  10.424747
S         889.0     90.0  0.177778  ...   0.0  2.0  90.0  24.639302


                std     min     25%      50%      75%       max
Embarked
C         45.919479  7.2250  7.2292  14.4583  27.7208  227.5250
Q          5.245083  6.8583  7.7500   7.7500   8.4583   24.1500
S         31.608644  0.0000  7.8958   8.3875  30.3750  221.7792

[3 rows x 56 columns]

In [51]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

df[['Name', 'Sex', 'Survived']][(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [ ]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

df[['Name','Age','Fare']][(df['Pclass'] == 1) & (df['Fare'] > df['Fare'].mean())]

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [54]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

not_null = df[(~df['Age'].isnull()) & (~df['Pclass'].isnull()) & (~df['Fare'].isnull())].groupby('Pclass')

print(not_null['Fare'].mean())
print(not_null['Fare'].median())

Pclass
1    87.961582
2    21.471556
3    13.229435
Name: Fare, dtype: float64
Pclass
1    69.3000
2    15.0458
3     8.0500
Name: Fare, dtype: float64

In [61]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

# idxmax()는 pandas의 Series 혹은 DataFrame에서 최대값이 위치한 인덱스(레이블) 를 찾아 반환하는 메서드.

groupby_embarked = df.groupby('Embarked')

print(groupby_embarked['Age'].mean())

top_embarked = df['Embarked'].value_counts().idxmax()

# df['Embarked'].value_counts() / port number가 행 인덱스로 된 series

total_top = df[df['Embarked'] == top_embarked]

survived_top = total_top[total_top['Survived'] == 1]

print(len(survived_top) / len(total_top))

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
0.33695652173913043

In [74]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

female_thrity_survived = df[(df['Sex'] == 'female') & (df['Age'] >= 30) &(df['Survived'] == 1)]

print(len(female_thrity_survived) / len(df))

0.10325476992143659

In [75]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

con_data = df[(df['SibSp']  + df['Parch']) >=3]

survived_data = con_data[con_data['Survived'] == 1]

print(len(survived_data) / len(con_data))

0.34065934065934067

In [69]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력

carbin_data = df[df['Cabin'].notna()].groupby(['Pclass'])

carbin_data['Survived'].mean()

Pclass
1    0.664773
2    0.812500
3    0.500000
Name: Survived, dtype: float64